<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class OccupationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // 職種
        DB::table('occupations')->insert([
            // IT・エンジニア
            [
                'name' => 'ITコンサルタント',
            ],
            [
                'name' => 'プログラマー',
            ],
            [
                'name' => 'システム保守運用',
            ],
            [
                'name' => 'カスタマーエンジニア',
            ],
            [
                'name' => 'セールスエンジニア',
            ],
            [
                'name' => 'WEBデザイナー',
            ],
            [
                'name' => 'データサイエンティスト',
            ],
            [
                'name' => 'ネットワークエンジニア',
            ],
            [
                'name' => 'システムコンサルタント',
            ],
            [
                'name' => 'システムエンジニア',
            ],
            [
                'name' => 'カスタマーサポート',
            ],
            [
                'name' => 'データアナリスト',
            ],
            [
                'name' => 'データエンジニア',
            ],
            [
                'name' => 'フロントエンドエンジニア',
            ],
            [
                'name' => 'バックエンドエンジニア',
            ],
            // 営業
            [
                'name' => '法人営業',
            ],
            [
                'name' => 'ルート営業/ラウンダー',
            ],
            [
                'name' => 'テレフォンアポインター',
            ],
            [
                'name' => '営業アシスタント',
            ],
            [
                'name' => 'プランナー/アドバイザー/コンサルタント',
            ],
            [
                'name' => '派遣コーディネーター',
            ],
            [
                'name' => '営業幹部候補',
            ],
            [
                'name' => '営業その他',
            ],
            // 事務・オフィスワーク
            [
                'name' => '一般事務',
            ],
            [
                'name' => '経理事務',
            ],
            [
                'name' => '営業事務',
            ],
            [
                'name' => '受付/秘書',
            ],
            [
                'name' => '伝票整理/データ入力',
            ],
            [
                'name' => '電話対応/コールセンター',
            ],
            [
                'name' => '人事/総務/法務',
            ],
            [
                'name' => '企画/マーケティング/広報',
            ],
            [
                'name' => '保険/金融関連',
            ],
            [
                'name' => '事務/オフィスワークその他',
            ],
            // 販売・サービス系
            [
                'name' => 'アパレル/靴',
            ],
            [
                'name' => 'コンビニ',
            ],
            [
                'name' => 'スーパー/デパート',
            ],
            [
                'name' => '家電量販店',
            ],
            [
                'name' => '携帯ショップ/携帯販売',
            ],
            [
                'name' => 'インテリア/雑貨販売',
            ],
            [
                'name' => 'ドラッグストア/化粧品販売・登録販売者',
            ],
            [
                'name' => '書店・レンタル/CDショップ',
            ],
            [
                'name' => 'ホームセンター/カー用品',
            ],
            [
                'name' => 'アクセサリー/ジュエリー',
            ],
            [
                'name' => 'フラワーショップ',
            ],
            [
                'name' => 'ペットショップ',
            ],
            [
                'name' => '店長/マネージャー(販売)',
            ],
            [
                'name' => '販売その他',
            ],
            // 飲食・フード
            [
                'name' => 'ファミレス/レストラン',
            ],
            [
                'name' => 'ファーストフード',
            ],
            [
                'name' => '居酒屋/ダイニングバー',
            ],
            [
                'name' => 'カフェ/喫茶店',
            ],
            [
                'name' => 'ラーメン/うどん/そば',
            ],
            [
                'name' => '焼肉店/しゃぶしゃぶ店',
            ],
            [
                'name' => '寿司/和食/定食',
            ],
            [
                'name' => 'フードコート',
            ],
            [
                'name' => 'パン屋/ケーキ屋/スイーツ店',
            ],
            [
                'name' => '宅配/デリバリー',
            ],
            [
                'name' => 'お弁当/テイクアウトフード',
            ],
            [
                'name' => '調理師/調理補助',
            ],
            [
                'name' => 'ホールスタッフ',
            ],
            [
                'name' => 'キッチンスタッフ',
            ],
            [
                'name' => 'ホールとキッチン',
            ],
            [
                'name' => '洗い場/食品洗浄',
            ],
            [
                'name' => '試飲/試食',
            ],
            [
                'name' => '店長/マネージャー(飲食/フード)',
            ],
            [
                'name' => '飲食/フードその他',
            ],
            // サービス・警備・清掃
            [
                'name' => 'ショールーム/不動産',
            ],
            [
                'name' => 'ガソリンスタンド',
            ],
            [
                'name' => 'クリーニング店',
            ],
            [
                'name' => 'レンタカー/ディーラー/中古車販売',
            ],
            [
                'name' => '旅行会社/ツアーコンダクター',
            ],
            [
                'name' => '葬儀/セレモニー',
            ],
            [
                'name' => '結婚式場/ブライダル',
            ],
            [
                'name' => '新聞店',
            ],
            [
                'name' => '引越し',
            ],
            [
                'name' => '洗車/ピットサービス/タイヤ交換',
            ],
            [
                'name' => '警備員/監視員',
            ],
            [
                'name' => '交通誘導',
            ],
            [
                'name' => '清掃員/ルームメイク',
            ],
            [
                'name' => 'ビル/ハウスクリーニング',
            ],
            [
                'name' => '管理人',
            ],
            [
                'name' => '検針員',
            ],
            [
                'name' => 'サンプリング',
            ],
            [
                'name' => 'フロント/受付(サービス)',
            ],
            [
                'name' => '店長/マネージャー(サービス・警備・清掃)',
            ],
            [
                'name' => 'サービス/警備/清掃その他',
            ],
            // イベント・レジャー・娯楽
            [
                'name' => 'カラオケ',
            ],
            [
                'name' => 'パチンコ',
            ],
            [
                'name' => '映画館/ゲームセンター/ボウリング場',
            ],
            [
                'name' => '温泉/銭湯/スーパー銭湯',
            ],
            [
                'name' => 'ゴルフ場',
            ],
            [
                'name' => 'ジム/プール',
            ],
            [
                'name' => 'ホテル/旅館/ペンション',
            ],
            [
                'name' => 'スキー場',
            ],
            [
                'name' => 'イベント/キャンペーンスタッフ',
            ],
            [
                'name' => '店長/マネージャー(イベント/レジャー/娯楽)',
            ],
            [
                'name' => 'イベント/レジャー/娯楽その他',
            ],
            // 教育・カルチャー・スポーツ
            [
                'name' => '塾講師/家庭教師',
            ],
            [
                'name' => '保育士/幼稚園教諭',
            ],
            [
                'name' => 'インストラクター/コーチ',
            ],
            [
                'name' => '試験監督',
            ],
            [
                'name' => '教育/カルチャー/スポーツその他',
            ],
            // 理・美容
            [
                'name' => '理容師',
            ],
            [
                'name' => '美容師',
            ],
            [
                'name' => 'ヘアメイク/メイクアップ/着付け/スタイリスト',
            ],
            [
                'name' => 'エステ/ネイル',
            ],
            [
                'name' => 'リラクゼーション/セラピスト',
            ],
            [
                'name' => 'フロント/受付(理/美容)',
            ],
            [
                'name' => '店長/マネージャー(理/美容)',
            ],
            [
                'name' => 'アシスタント(理美容)',
            ],
            [
                'name' => '理/美容その他',
            ],
            // 医療・介護・福祉
            [
                'name' => '看護師',
            ],
            [
                'name' => '准看護師',
            ],
            [
                'name' => '看護助手',
            ],
            [
                'name' => '助産師',
            ],
            [
                'name' => '保健師',
            ],
            [
                'name' => '医療事務/受付',
            ],
            [
                'name' => '医療技術者',
            ],
            [
                'name' => '介護福祉士',
            ],
            [
                'name' => 'ケアマネージャー',
            ],
            [
                'name' => '介護職員/ヘルパー',
            ],
            [
                'name' => '介護事務',
            ],
            [
                'name' => '歯科衛生士/歯科助手',
            ],
            [
                'name' => '薬剤師',
            ],
            [
                'name' => '整体師/柔道整復師',
            ],
            [
                'name' => '栄養士/管理栄養士',
            ],
            [
                'name' => '施設内調理/調理補助',
            ],
            [
                'name' => '作業療法士',
            ],
            [
                'name' => '理学療法士',
            ],
            [
                'name' => '児童指導員/放課後児童支援員',
            ],
            [
                'name' => '相談員',
            ],
            [
                'name' => 'サービス提供責任者',
            ],
            [
                'name' => '職業指導員/就労支援員',
            ],
            [
                'name' => '医療/介護/福祉その他',
            ],
            // ドライバー・配達
            [
                'name' => '小/中型ドライバー',
            ],
            [
                'name' => '大型ドライバー',
            ],
            [
                'name' => 'タクシー/ハイヤー/バス運転手',
            ],
            [
                'name' => 'バイク便',
            ],
            [
                'name' => '配車/点呼員',
            ],
            [
                'name' => '送迎ドライバー',
            ],
            [
                'name' => '宅配/配達',
            ],
            [
                'name' => '軽貨物',
            ],
            [
                'name' => '新聞配達/牛乳配達その他',
            ],
            // 製造・工場・倉庫
            // クリエイティブ・編集・出版
            [
                'name' => 'WEBデザイナー',
            ],
            [
                'name' => 'デザイナー/イラストレーター',
            ],
            [
                'name' => 'DTPオペレーター',
            ],
            [
                'name' => '設計/製図',
            ],
            [
                'name' => '印刷/製本',
            ],
            [
                'name' => '校正/編集',
            ],
            [
                'name' => 'ライター/記者/撮影スタッフ',
            ],
            [
                'name' => 'マスコミ関連',
            ],
            [
                'name' => 'クリエイティブ/編集/出版社その他',
            ],
            // 専門職
            [
                'name' => '調理師/栄養士',
            ],
            [
                'name' => '税理士/会計士',
            ],
            [
                'name' => '通訳/翻訳',
            ],
            [
                'name' => 'トリマー',
            ],
            [
                'name' => '研究/開発関連',
            ],
            [
                'name' => 'マッサージ師/はり師/鍼灸師',
            ],
            [
                'name' => '整備士',
            ],
            [
                'name' => '警察官/自衛官',
            ],
            [
                'name' => '修理/メンテナンス',
            ],
            [
                'name' => '塗装',
            ],
            [
                'name' => '溶接/板金',
            ],
            [
                'name' => '電気/水道/ガス/空調設備工事',
            ],
            [
                'name' => '造園',
            ],
            [
                'name' => '専門職その他',
            ],
            // 土木・建設・農水産
            [
                'name' => '建設士',
            ],
            [
                'name' => '土木工事関連',
            ],
            [
                'name' => '重機オペレーター',
            ],
            [
                'name' => '現場監督',
            ],
            [
                'name' => '大工/鳶/職人',
            ],
            [
                'name' => '玉掛け/クレーン',
            ],
            [
                'name' => '農業/林業/漁業/畜産業',
            ],
            [
                'name' => '除染作業員',
            ],
            [
                'name' => '土木/建設/農水産その他',
            ],
        ]);
    }
}
